// ***switch Задача Напиши скрипт, где цена номера в отеле зависит от количества звезд,
// 1 звезда, цена 20
// 2 звезды - цена 30
// 3 звезды - цена 50
// 4 звезды - цена 100
// 5 звезд - цена 120
// больше звезд- такого количества звезд не существует

//  Можно обьединить несколько кейсов, там если выполен один из них, то есть ИЛИ кейс1 или кейс2

// const stars = 2;
// let price;

// switch (stars) {
//     case 1:
//     case 2:
//         price = 20;
//         break;
    
//     // case 2:
//     //     price = 30;
//     //     break;
    
//     case 3:
//         price = 50;
//         break;
    
//     case 4:
//         price = 100;
//         break;
    
//     case 5:
//         price = 120;
//         break;
    
//     default:
//         console.log('такого количества звезд не существует')
// }
// console.log(price);

// *** Задача Напиши скрипт, который считает общую сумму зп работников.
// - количество работников - переменная employees
//     - зп каждого работника - случайное число от 500 до 5000
// - сумма totalSalary и вывести  в консоль

// const employees = 5;
// const minSalary = 500;
// const maxSalary = 5000;
// let totalSalary = 0;

// for (let i = 1; i <= employees; i += 1){
//     const salary = Math.round(Math.random() * (maxSalary - minSalary) + minSalary);
//     console.log(`ЗП работника номер ${i} - ${salary}`)
//     totalSalary += salary;
//     console.log(totalSalary);
// }
// console.log('totalSalary:', totalSalary)


// *** Задача Напиши скрипт, который считает сумму четных чисел, которые входят в диапазон от мин до макс.

// const min = 1;
// const max = 5;
// let total = 0;

// for (let i = min; i <= max; i += 1){
//     console.log(i);
//     if (i % 2 === 0) {
//         console.log('четное:', i)
//         total += i;
//     }
// }
// console.log('total:', total)

// или Логика от обратного

// for (let i = min; i <= max; i += 1){
//     console.log(i);
//     if (i % 2 !== 0) {
//         console.log(' не четное:', i);
//         continue
//     }
//     total += i;
//     console.log('четное:', i);
// }
// console.log('total:', total)

// *** Задача покупки.Если баланм меньше, чем сумма покупки то Сообщение, что денег недостаточно.Если больше, то вывести остаток

// let balance = 2000;
// const payment = 5000;

// if (balance >= payment) {
//     console.log('Все ок');
//     balance -= payment;
//     console.log(`Остаток денег на счету ${balance}`)
// } else {
//     console.log('Денег недостаточно')
// }
// console.log('Операция завершена')

// ## Example 2 - Відображення часу (if...else)
// Напиши скрипт для відображення годин та хвилин у консолі браузера у вигляді рядка  формату `"14 г. 26 хв."`. Якщо значення змінної `minutes` дорівнює `0`, то виводь рядок `"14 г."`, без хвилин.

// const minutes = 0;
// const hours = 14;
// let result = `${hours}г.`

// if (minutes !== 0) {
//     result = `${hours}г. ${minutes}хв.`
// }

// console.log(result)

// ## Example 3 - Розгалуження
// Напиши скрипт, який виводить у консоль рядок `"Це позитивне число"`, якщо у prompt користувач ввів число більше нуля. Якщо було введено нуль, виводь в консоль рядок `"Це нуль"`. Якщо передали від'ємне число, у консолі
// повинен бути рядок `"Це негативне число"`.

// const number = Number(prompt('Введіть число'));
// if (number > 0) {
//      console.log('Це позитивне число')
// } else if (number < 0) {
//      console.log('Це негативне число')
    
// } else if (number === 0) {
//     console.log('Це нуль')
// } else {
//     console.log('Це не число')
// }
 
 // ## Example 4 - Вкладені розгалуження
// Напиши скрипт, який порівнює числа у змінних `a` та `b`. Якщо обидва  значення більше `100`, то виведи в консоль максимальне з них. В протилежному  випадку у консолі повинна бути сума значення `b` та числа 512.

// const a = 200;
// const b = 20;

// if (a > 100 && b > 100) {
//     if (a > b) {
//         console.log(a);
//     } else {
// console.log(b);
//     }
// } else {
//     console.log( b + 512)
// }


// ## Example 5 - Форматування посилання (endsWith)
// Напиши скрипт який перевіряє чи закінчується значення змінної `link` символом `/`. Якщо ні, додай до кінця значення `link` цей символ. Використовуй  конструкцію `if...else`.

// let link = 'http//ghghg';

// if (!link.endsWith('/')){
//     link += '/';
// }
// console.log(link)
 
// ## Example 6 - Форматування посилання (includes та логічне «І»)
// Напиши скрипт який перевіряє чи закінчується значення змінної `link` символом `/`. Якщо ні, додай до кінця значення `link` цей символ, але тільки в тому випадку, якщо в `link` є підрядок `"my-site"`. Використовуй конструкцію
// `if...else`.

// let link = 'https://my-site.com/about';

// if (!link.endsWith('/') && link.includes('my-site')) {
//     link += '/';
// }
// console.log(link);

// ## Example 7 - Форматування посилання (тернарний оператор)
// Виконай рефакторинг коду задачі номер 4, використовуючи тернарний оператор.

// let link = 'https://my-site.com/about/';

// !link.endsWith('/') && link.includes('my-site') ? link += '/' : null;
// console.log(link);


// ## Example 9 - Дедлайн здачі проекту (if...else)
// Напиши скрипт для відображення часу дедлайну здачі проекту. Використовуй конструкцію `if...else`.
// - Якщо до дедлайну 0 днів - виведи рядок `"Сьогодні"`
// - Якщо до дедлайну 1 день - виведи рядок `"Завтра"`
// - Якщо до дедлайну 2 дні - виведи рядок `"Післязавтра"`
// - Якщо до дедлайну 3+ днів - виведи рядок `"Дата у майбутньому"`

// const daysUntilDeadline = 3;

// if (daysUntilDeadline === 0) {
//     console.log('Сьогодні');
// } else if (daysUntilDeadline === 1) {
//     console.log('Завтра');
// } else if (daysUntilDeadline === 2) {
//     console.log('Післязавтра');
// } else if (daysUntilDeadline === 2) {
//     console.log('Післязавтра');
// } else {
//     console.log('Дата у майбутньому');
// }


// ## Example 10 - Дедлайн здачі проекту (switch)
// Виконай рефакторинг коду задачі номер 9 використовуючи `switch`.

// const daysUntilDeadline = 3;

// switch (daysUntilDeadline) {
//     case 0:
//         console.log('Сьогодні');
//         break;
    
//     case 1:
//         console.log('Завтра');
//         break;
    
//     case 2:
//         console.log('Післязавтра');
//         break;
    
//     default:
//         console.log('Дата у майбутньому');
// }

// ## Example 11 - Цикл for
// Напиши цикл for, який виводить у консоль браузера числа за зростанням від `min` до `max`, але тільки якщо число кратне `5`.

// const min = 3;
// const max = 99;

// for (let i = min; i <= max; i += 1) {
//     if (i % 5 === 0) {
//         console.log(i);
//     }
// }

// ## Example 12 - Введення користувача та розгалуження
// Напиши скрипт, який питатиме логін за допомогою `prompt` та логувати результат у консоль браузера.
// - Якщо відвідувач вводить `"Адмін"`, то `prompt` запитує пароль
// - Якщо нічого не введено або натиснуто клавішу Esc - вивести рядок `"Скасовано"`
// - В іншому випадку вивести рядок `"Я вас не знаю"`
// Пароль перевіряти так:
// - Якщо введено пароль `"Я адмін"`, то вивести рядок `"Здрастуйте!"`
// - Інакше виводити рядок `"Невірний пароль"

// const userInput = prompt('Введіть свою посаду');


// if (userInput === 'Адмін') {
//     const password = prompt('Введіть пароль');
//     if (password === 'Я адмін') {
//         console.log('Здрастуйте!')
//     } else {
//         console.log('Невірний пароль')
//     }
// } else if (!userInput) {
//     console.log('Скасовано!')
// }
// else {
//     console.log('Я вас не знаю')
// }





